[
  {
    "version": "0.3.9",
    "date": "2025-11-23",
    "notes": [
      "Backend de registro: funciones RPC register_send_code y register_verify_code integradas con Resend mediante la extensión http de Postgres.",
      "Validación de código de verificación con expiración a 2 horas y almacenamiento en la tabla register_codes.",
      "Flujo de registro preparado para funcionar de punta a punta con el frontend existente.",
      "Perfiles: generación automática de p_username a partir del nombre/correo + fecha/hora en el backend."
    ]
  },
  {
    "version": "0.3.8",
    "date": "2025-11-22",
    "notes": [
      "Nuevo flujo de registro en 3 pasos con validación en tiempo real del correo electrónico.",
      "Campos de registro con labels flotantes, contador de caracteres para el nombre y botones de Cancelar / Crear cuenta / Next / Sign up.",
      "Preparación de integración con Resend + Supabase para envío y verificación de código de confirmación."
    ]
  },
  {
    "version": "0.3.7",
    "date": "2025-11-22",
    "notes": [
      "Ajustes del layout fijo: header, toolbar, títulos del main y footer coordinados para desktop y mobile.",
      "Correcciones en el cierre de sesión para que los iconos de usuario cambien correctamente también en celular."
    ]
  },
  {
    "version": "0.3.6",
    "date": "2025-11-22",
    "notes": [
      "Buscador avanzado: Únicos, Similares, Incluidas y cercanía, contemplando caracteres especiales.",
      "Texto del campo de búsqueda en el toolbar ahora se muestra en negrita para mayor legibilidad.",
      "Ajustes visuales menores en breadcrumb y resultados para mantener consistencia con la nueva lógica de búsqueda."
    ]
  },
  {
    "version": "0.3.5",
    "date": "2025-11-21",
    "notes": [
      "Títulos fijos en el main con cerramiento y flechas laterales en Navigator y Focus.",
      "Reorganización de botones de usuario (Preferencias, Iniciar sesión, Registrarse, Cuenta, Cerrar sesión).",
      "Preferencias: dropdowns de Colección y Corpus alimentados desde memoria y actualizados al cambiar idioma."
    ]
  },
  {
    "version": "0.3.4",
    "date": "2025-11-21",
    "notes": [
      "Correcciones en el loader inicial y sincronización de preferencias desde memoria.",
      "Ajustes en el footer fijo y manejo de versión mostrada en la interfaz."
    ]
  },
  {
    "version": "0.3.3",
    "date": "2025-11-20",
    "notes": [
      "Reestructura de resultados de búsqueda (exactos, contemplados y aproximados) y formato de listado por versículo.",
      "Mejoras en navegación entre versículos enfocados con flechas laterales."
    ]
  },
  {
    "version": "0.3.2",
    "date": "2025-11-19",
    "notes": [
      "Optimización del algoritmo de búsqueda respetando mayúsculas, minúsculas, acentos y caracteres especiales.",
      "Limpieza de atajos de búsqueda antiguos y mejoras de rendimiento en tiempo real."
    ]
  },
  {
    "version": "0.3.1",
    "date": "2025-11-18",
    "notes": [
      "Unificación del estilo de títulos en el main y corrección de solapas invertidas.",
      "Mejoras de contraste en iconos y ajustes menores de UI."
    ]
  },
  {
    "version": "0.3.0",
    "date": "2025-11-16",
    "notes": [
      "Cuadrante visual en el main con bordes interactivos.",
      "Refactor del layout para que Navigator, Results y Focus convivan en el mismo marco de estudio.",
      "Integración básica de loader inicial y primer paso hacia la persistencia de preferencias."
    ]
  },
  {
    "version": "0.2.6",
    "date": "2025-11-15",
    "notes": [
      "Cuenta de usuario: preparación de vistas de perfil y métricas personales (vistas, likes, notas, shares)."
    ]
  },
  {
    "version": "0.2.5",
    "date": "2025-11-15",
    "notes": [
      "Pantallas de Registro y Login integradas con Supabase.",
      "Preferencias, Register y Login funcionando al 100% según configuración actual.",
      "Validación y guardado de color, font type, font size e idioma en la tabla profiles."
    ]
  },
  {
    "version": "0.2.0",
    "date": "2025-11-14",
    "notes": [
      "Mejoras en loader, fuentes personalizadas y footer fijo en desktop y mobile."
    ]
  },
  {
    "version": "0.1.0",
    "date": "2025-11-13",
    "notes": [
      "Versión inicial de Study.GODiOS.org con header, toolbar, panels y preferencias básicas."
    ]
  }
]