[
  {
    "version": "0.2.9",
    "date": "2025-11-19",
    "notes": [
      "Buscador enriquecido: entiende referencias tipo \"Juan 3\", \"Juan 3:16\" e \"Isaias 41:10\" y respeta idioma, colección y corpus.",
      "Búsquedas por nombre de libro (con o sin acentos) muestran todos los versículos de ese libro.",
      "Nivel Focus renovado: versículo principal destacado como bloque protagonista dentro del main.",
      "Tablero de control en Focus con botón de regreso que abre el capítulo completo en Navigator.",
      "Loader de Navigator mejorado: overlay de carga más suave sobre el área de estudio.",
      "Resultados de búsqueda y lista de Navigator con líneas más compactas (gap/padding vertical reducido)."
    ]
  },
  {
    "version": "0.2.8",
    "date": "2025-11-16",
    "notes": [
      "Breadcrumb funcional en toolbar: Collection > Corpus > Nivel 3 > Nivel 4 > Nivel 5.",
      "Breadcrumb enlaza a Preferencias al hacer clic en Collection > Corpus.",
      "Campo de búsqueda ajusta su ancho y su placeholder (Buscar / Search) según el idioma."
    ]
  },
  {
    "version": "0.2.7",
    "date": "2025-11-16",
    "notes": [
      "Integración de tabla entries con Preferencias (Collections / Corpus).",
      "Carga paginada de entries en tandas de 1000 registros con deduplicación.",
      "Selects de Colección y Corpus con barra de progreso en el propio campo mientras cargan."
    ]
  },
  {
    "version": "0.2.6",
    "date": "2025-11-16",
    "notes": [
      "Pantallas de Registro e Inicio de sesión integradas con Supabase Auth.",
      "Perfiles de usuario creados automáticamente en la tabla public.profiles.",
      "Pantalla de Preferencias funcionando al 100% (idioma, fuente, color, etc.).",
      "Ajustes en constraints y triggers de profiles para evitar errores de registro.",
      "Header actualizado: Bendecido X + HUD de créditos, escalones y piso."
    ]
  },
  {
    "version": "0.2.5",
    "date": "2025-11-15",
    "notes": [
      "Implementación inicial de Registrarse con Supabase auth.signUp.",
      "Integración de AuthSession global para reflejar estado de login en el header."
    ]
  },
  {
    "version": "0.2.4",
    "date": "2025-11-15",
    "notes": [
      "Fondo de toolbar con un 20% del color de sistema.",
      "Solapa del título en main cuelga visualmente del toolbar.",
      "Preferencias: texto ON/OFF del switch de Luz a la derecha.",
      "Preferencias: selector de Color sin halo alrededor del cuadrado."
    ]
  },
  {
    "version": "0.2.3",
    "date": "2025-11-14",
    "notes": [
      "Toolbar siempre en una sola línea en mobile.",
      "Buscador flexible según el espacio disponible.",
      "Breadcrumb con texto truncado con puntos suspensivos."
    ]
  },
  {
    "version": "0.2.2",
    "date": "2025-11-14",
    "notes": [
      "Ventana de Preferencias compacta y usable en mobile.",
      "Selector de fuentes leyendo @font-face desde CSS.",
      "Header fijo y responsivo; iconos siempre visibles."
    ]
  },
  {
    "version": "0.2.0",
    "date": "2025-11-14",
    "notes": [
      "Ventana de Preferencias compacta y usable en mobile.",
      "Selector de fuentes leyendo @font-face desde CSS.",
      "Header fijo y responsive; iconos siempre visibles en el celular.",
      "Limpieza de loader y errores de consola (fonts, changelog, etc.)."
    ]
  },
  {
    "version": "0.1.0",
    "date": "2025-11-13",
    "notes": [
      "Versión inicial de Study.GODiOS.org con header, toolbar, panels y preferencias básicas."
    ]
  }
]